@extends('layout')

@section('content')
        <!-- Banner -->
<section id="banner">
    <div class="content">
        <header>
            <h2>مسابقات برنامه‌نویسی دانش‌آموزی امیرکبیر</h2>
            <p>درباره مسابقات</p>
        </header>
        <span class="image"><img src="../images/ACMLOGO.jpg" alt="" /></span>
    </div>
    <a href="#one" class="goto-next"></a>
</section>

<!-- One -->
<section id="one" class="spotlight style1 bottom">
    <span class="image fit main"><img src="images/code.jpg" alt="" /></span>
    <div class="content">
        <div class="container">
            <div class="row">
                <div class="4u 12u$(medium)">
                    <header>
                        <h2>مسابقات برنامه‌نویسی چیست؟</h2>
                        <p>نسخه دانش‌آموزی</p>
                    </header>
                </div>
                <div class="4u 12u$(medium)">
                    <p>مسابقه برنامه نویسی دانش آموزی از جمله مسابقات برنامه نویسی است که هر سال در نقاط مختلفی از دنیا
                        برگزار میگردد. مخاطب اصلی این مسابقات دانش آموزان مقاطع دبیرستان و راهنمایی میباشد.</p>
                </div>
                <div class="4u$ 12u$(medium)">
                    <p>انجمن علمی دانشکده مهندسی کامپیوتر و فناوری اطلاعات دانشگاه صنعتی امیرکبیر به عنوان نهاد برگزار کننده
                        رویداد های علمی دانشجویی در دانشگاه در نظر دارد دومین دوره این رویداد را در دانشگاه امیرکبیر برگزار
                        نماید.</p>
                </div>
            </div>
        </div>
    </div>
    <a href="#two" class="goto-next scrolly"></a>
</section>

<!-- Two -->
<section id="two" class="spotlight style2 right">
    <span class="image fit main"><img src="images/tsb.jpg" alt="" /></span>
    <div class="content">
        <header>
            <h2>مسابقات برنامه نویسی به چه رقابتهایی گفته میشود؟</h2>
            <p>کمی بیشتر درباره مسابقات برنامه‌نویسی</p>
        </header>
        <p>مسابقات برنامه نویسی به مسابقاتی گفته میشود که در آن شرکت کنندگان با نوشتن برنامه های کامپیوتری و
            طراحی الگوریتم به رقابت می پردازند. این مسابقات معمولا به صورت انفرادی و یا تیم های متشکل از 3 نفر
            برگزار میگردد.
        </p>
        <ul class="actions">
            <li><a href="#what_is_acm" class="button">اطلاعات بیشتر</a></li>
        </ul>
    </div>
    <a href="#three" class="goto-next scrolly"></a>
</section>

<!-- Three -->
<section id="three" class="spotlight style3 left">
    <span class="image fit main bottom"><img src="images/code.jpg" alt="" /></span>
    <div class="content">
        <header>
            <h2>برگزار کننده این مسابقات کیست؟</h2>
            <p>درباره انجمن علمی دانشجویی دانشکده مهندسی کامپیوتر و فناوری اطلاعات دانشگاه صنعتی امیرکبیر</p>
        </header>
        <p>انجمن‌های علمی به عنوان تنها نهاد علمی-دانشجویی دانشگاه صنعتی امیرکبیر وظیفه برگزاری رویدادهای مختلف علمی را برعهده دارد. این نهاد از دانشجویان دانشگاه تشکیل شده است و تحت نظارت اداره کل انجمن‌های علمی دانشگاه مسابقات و چالش هایی را برای محک زدن دانشجویان برگزار می‌کند</p>
        <ul class="actions">
            <li><a href="#about_ssc" class="button">اطلاعات بیشتر</a></li>
        </ul>
    </div>
    <a href="#what_is_acm" class="goto-next scrolly"></a>
</section>

<!-- Four -->
<section id="what_is_acm" class="wrapper style1 special fade-up">
    <div class="container">
        <header class="major">
            <h2>مسابقات برنامه‌نویسی به چه رقابت‌هایی گفته می‌شود؟</h2>
        </header>
        <p>مسابقات برنامه نویسی به مسابقاتی گفته میشود که در آن شرکت کنندگان با نوشتن برنامه های کامپیوتری و
            طراحی الگوریتم به رقابت می پردازند. این مسابقات معمولا به صورت انفرادی و یا تیم های متشکل از 3 نفر
            برگزار میگردد.</p><p>
            روند کلی مسابقات به این صورت می باشد : با پخش سوالات طراحی شده توسط داوران رقابت آغاز می گردد؛
            هر سوال شامل صورت مسئله، ورودی برنامه، خروجی مورد انتظار، نمونه اطلاعات ورودی و خروجی و حداکثر
            زمان مورد انتظار برای برنامه است. شرکت کنندگان پس از نوشتن برنامه هر سوال، آن را برای داوران ارسال
            می کنند. داوران با تست کردن برنامه و با توجه به محدودیت های زمانی برای اجرای آن به تصحیح برنامه ها
            می پردازند و نتیجه ی آن را برای ارسال کننده می فرستند .</p><p>
            در پایان تیم هایی که بیشترین برنامه صحیح را در کمترین زمان و با کمترین پاسخ اشتباه ارسال کنند برنده
            مسابقه می شوند.
        </p>
        <p>معروف‌ترین این مسابقات، تحت عنوان «مسابقات برنامه‌نویسی بین المللی دانشجویی» در بین دانشگاه‌های کشورهای مختلف جهان برگزار می گردد. این مسابقات ابتدا به صورت منطقه‌ای، و سپس به میزبانی یک کشور برگزار می گردد. حامی اصلی این رقابت‌ها شرکتIBM  می باشد.</p>
        <p>از جمله مسابقات معروف برنامه‌نویسی، «مسابقات داخلی برنامه نویسی دانشجویی»  می‌باشد. این مسابقات غالباً برای انتخاب تیم‌های شرکت‌کننده در مسابقات منطقه‌ای برگزار می‌گردند. از جمله معتبرترین این رقابت‌ها می‌توان به مسابقات برنامه‌نویسی دانشجویی دانشگاه امیرکبیر اشاره کرد. این مسابقات هر سال و با حضور تیم هایی از دانشگاه های سراسر ایران برگزار می گردد.</p>
        <p>در پانزدهمین دوره مسابقات برناه‌نویسی دانشجویی که طبق روال هر دوره، به میزبانی دانشکده مهندسی کامپیوتر و فناوری اطلاعات دانشگاه امیرکبیر توسط انجمن علمی دانشجویی این دانشکده برگزار گردید، چندین تیم نیز از دانشگاه صنعتی مونیخ به صورت همزمان و از سایت آلمان در مسابقه شرکت داشتند.</p>
        <p>مسابقات برنامه‌نویسی فقط در سطح دانشگاه‌ها برگزار نمی‌شود؛ از دیگر رقابت‌های مطرح در این حوزه «مسابقات برنامه‌نویسی دانش‌آموزی»  می باشد.</p>
        <p>
            این مسابقات با حضور فیزیکی تیم ها در محل برگزاری مسابقه برگزار می‌شوند. اما به دلیل اینکه تیم‌های غیر تهرانی شاید امکان حضور در محل دانشکده مهندسی کامپیوتر و فناوری اطلاعات دانشگاه صنعتی امیرکبیر را نداشته باشند، مسابقه آنلاین نیز به صورت همزمان و با شروع مسابقه حضوری برگزار خواهد شد که تیم‌های غیر تهرانی می‌توانند در آن شرکت نمایند.</p>
        <p>
            مسابقه حضوری در دانشکده مهندسی کامپیوتر و فناوری اطلاعات دانشگاه صنعتی امیرکبیر و با حضور ۴ نفر از هر تیم (۳ نفر دانش‌آموز و یک نفر سرپرست تیم) برگزار می‌گردد.
        </p>
        <p><strong>
            توجه به این نکته حائز اهمین است که حضور سرپرست تیم برای شرکت تیم در مسابقه الزامی است.
            </strong>
        </p>
    </div>
    <a href="#about_ssc" class="goto-next scrolly"></a>
</section>

<section id="about_ssc" class="wrapper style1 special fade-up">
    <div class="container">
        <header class="major">
            <h2>انجمن علمی دانشجویی دانشکده مهندسی کامپیوتر و فناوری اطلاعات دانشگاه صنعتی امیرکبیر</h2>
        </header>
        <p>انجمن‌های علمی به عنوان تنها نهاد علمی-دانشجویی دانشگاه صنعتی امیرکبیر وظیفه برگزاری رویدادهای مختلف علمی را برعهده دارد. این نهاد از دانشجویان دانشگاه تشکیل شده است و تحت نظارت اداره کل انجمن‌های علمی دانشگاه مسابقات و چالش هایی را برای محک زدن دانشجویان برگزار می‌کند.</p>
        <p>
            انجمن علمی دانشکده مهندسی کامپیوتر و فناوری اطلاعات دانشگاه صنعتی امیرکبیر، به مدت 3 سال متوالی عنوان انجمن علمی برتر در زمینه برگزاری مسابقات را به خود اختصاص داده است. این نهاد برگزاری مسابقاتی ازقبیل مسابقات برنامه نویسی بین المللی دانشجویی (برگزاری مشترک با دانشگاه های TUM  آلمان و EPFL سوئیس)، مسابقات ملی ایده پردازی در زمینه اپلیکیشن های تلفن همراه ، چالش ایده پردازی توسن، مسابقات ایده بازار، مسابقات ملی طراحی بردهای دیجیتال  و ... بوده است که این رویداد‌ها توسط حامیانی مانند :مرکز تحقیقات مخابرات ایران، کافه بازار، شرکت هلدینگ توسن، کانون کارآفرینی ایران، بانک کشاورزی، بانک ملت، شرکت عصر تلکام و ... حمایت شده اند.</p>
        <p>
            مسابقه برنامه نویسی دانش آموزی از جمله مسابقات برنامه نویسی است که هر سال در نقاط مختلفی از دنیا برگزار می‌گردد. مخاطب اصلی این مسابقات دانش آموزان مقاطع دبیرستان و راهنمایی می‌باشد.
        </p>
        <p>انجمن علمی دانشکده مهندسی کامپیوتر و فناوری اطلاعات دانشگاه صنعتی امیرکبیر به عنوان نهاد برگزار کننده رویداد های علمی دانشجویی در دانشگاه در نظر دارد دومین دوره این رویداد را در دانشگاه امیرکبیر برگزار نماید. </p>
    </div>
</section>


@endsection