@extends('layout')

@section('content')
    <section id="five" class="wrapper style special fade">
        <div class="container">
            <header class="major">
                <h2>اولین دوره مسابقات برنامه‌نویسی دانش آموزی</h2>
            </header>
            <p>اولین دوره این مسابقات در سال ۱۳۹۲ توسط انجمن علمی دانشکده مهندسی کامپیوتر و فناوری اطلاعات برگزار شد. در این دوره از مسابقات  ۱۵۳ نفر دانش‌آموز در قالب ۵۱ تیم از دبیرستان‌های مختلف کشور ازقبیل علامه حلی، دبیرستان‎‌های فرزانگان، انرژی اتمی، دبیرستان‎‌های سلام، روزبه، مفید، علوی، کمال، شهید سلطانی(کرج)، دبیرستان شهید هاشمی‌نژاد(مشهد)، شهید اژه‌ای(اصفهان) و ... شرکت کردند.</p>
        </div>
    </section>
@endsection
